### Resolvendo valores negativos para atributos como Age

In [48]:
import pandas as pd # biblioteca pandas para métodos matemáticos
import numpy as np

In [ ]:
base = pd.read_csv('../datasets/credit-data.csv') # carregando a base de dados

In [25]:
base.head() # lendo os dados

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0
3         4  42709.534201  45.751972  6103.642260        0
4         5  66952.688845  18.584336  8770.099235        1

In [17]:
base.describe() # efetuando uma pequena descrição de toda a base

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [18]:
base.loc[base['age'] < 0] # verificando apenas os valores negativos para idade AGE

    clientid        income        age         loan  default
15        16  50501.726689 -28.218361  3977.287432        0
21        22  32197.620701 -52.423280  4244.057136        0
26        27  63287.038908 -36.496976  9595.286289        0

In [20]:
# Correção01 pode apagar toda a coluna de dados(Não recomendado)
base.drop('age', 1, inplace=True)

In [ ]:
#Correção02 apagar apenas os registros com problemas(Não recomendado)
base.drop(base[base.age <0].index, inplace=True) # só irá deletar as linhas com numeros menores que 0 Zero

In [26]:
#Correção03 preencher de modo manual, entrando em contato com a pessoa(Inviável)

#Correção04 recomenda-se usar a média entre as idades
base.mean()
base['age'].mean() # 40.80755937840458
#Após verificar a média, pode-se notar que oi usado os numeros negativos, visto que

40.80755937840458

In [27]:
#será necessário apenas fazer a médias apenas dos valores positivos
base['age'][base.age > 0].mean() # 40.92770044906149

40.92770044906149

In [28]:
#para substituir a média pelos valors negativos
base.loc[base.age < 0, 'age'] = 40.92

In [31]:
base.head() # lendo os dados

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0
3         4  42709.534201  45.751972  6103.642260        0
4         5  66952.688845  18.584336  8770.099235        1

### Verificando valores faltantes

In [32]:
pd.isnull(base['age'])

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28       True
29      False
        ...
1970    False
1971    False
1972    False
1973    False
1974    False
1975    False
1976    False
1977    False
1978    False
1979    False
1980    False
1981    False
1982    False
1983    False
1984    False
1985    False
1986    False
1987    False
1988    False
1989    False
1990    False
1991    False
1992    False
1993    False
1994    False
1995    False
1996    False
1997    False
1998    False
1999    False
Name: age, Length: 2000, dtype: bool

In [58]:
base.loc[pd.isnull(base['age'])] # filtra os valores faltantes

    clientid        income  age         loan  default
28        29  59417.805406  NaN  2082.625938        0
30        31  48528.852796  NaN  6155.784670        0
31        32  23526.302555  NaN  2862.010139        0

In [49]:
#todas as linhas com : e pega todas as linhas do atributo 1 até o atributo 4 e pula a seguencia que começa por 0
previsores = base.iloc[:, 1:4].values

In [50]:
classe = base.iloc[:, 4].values

In [56]:
# função que remove os valores NaN de todos os previsres
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values = np.nan, strategy = 'mean')
imputer = imputer.fit(previsores[:, 1:4])
previsores[:, 1:4] = imputer.transform(previsores[:, 1:4])

In [54]:
previsores

array([[6.61559251e+04, 5.90170151e+01, 8.10653213e+03],
       [3.44151540e+04, 4.81171531e+01, 6.56474502e+03],
       [5.73171701e+04, 6.31080495e+01, 8.02095330e+03],
       ...,
       [4.43114493e+04, 2.80171669e+01, 5.52278669e+03],
       [4.37560566e+04, 6.39717958e+01, 1.62272260e+03],
       [6.94365796e+04, 5.61526170e+01, 7.37883360e+03]])

In [55]:
classe

array([0, 0, 0, ..., 1, 0, 0], dtype=int64)